Revit 2026 API

# ProjectInfoAuthor Property

---

Get or Set the Project Author of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Author { get; set; }
```
```vb
Public Property Author As String
	Get
	Set
```
```cpp
public:
property String^ Author {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Author : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Author of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace